app/Filters/Auth.php

    public function before(RequestInterface $request, $arguments = null)
    {
        $key = getenv('JWT_PRIVATE_KEY');

        $header = $request->getServer("HTTP_AUTHORIZATION");

        if(!$header){
            $response = service("response");
            $response->setJSON([
                'status'    => false,
                'message'   => 'Access Denied'
            ]);
            return $response->setStatusCode(ResponseInterface::HTTP_UNAUTHORIZED);
        }

        try {
            $headerParts = explode(' ', $header);
            $token = $headerParts[1];
            $decoded = JWT::decode($token, new Key($key, 'HS256'));

            $revokedTokenModel = new \App\Models\RevokedTokenModel();
            $isBlacklisted = $revokedTokenModel->where('token', $token)->countAllResults() > 0;
---
SELECT COUNT(*) AS `numrows`
FROM `revoked_tokens`
WHERE `token` = 'eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJ1c2VyX2lkIjoiMSIsImV4cCI6MTY4ODc0ODY1N30.Eb9eQL5H181n9LQhF_7ITnWG-wj7GXpobyySjopxp7M'