app/Controllers/AuthController.php

INSERT INTO `users` (`username`, `email`, `password`) VALUES ('admin', 'faizalnf1800@gmail.com', '$2y$10$wdZ2nWwwvevW04r824Aok.rrrKBsNjOAdlPrYSGpffKZqsTgg8T9i')
---
    public function register()
    {
        // Retrieve JSON data from the request body
        $data = $this->request->getJSON(true);

        // Set validation rules
        $validation = \Config\Services::validation();
        $validation->setRules([
            'username' => 'required',
            'email' => 'required|valid_email',
            'password' => 'required|min_length[6]'
        ]);

        // Run the validation
        if (!$validation->run($data)) {
            return $this->failValidationErrors($validation->getErrors());
        }

        // Create a new user
        $user = [
            'username' => $data['username'],
            'email' => $data['email'],
            'password' => password_hash($data['password'], PASSWORD_BCRYPT)
        ];

        $this->model->insert($user);