app/Controllers/ProtectedController.php

SELECT *
FROM `users`
WHERE `users`.`id` = '1'
---
    public function index()
    {
        $header = $this->request->getServer('HTTP_AUTHORIZATION');
        $headerParts = explode(' ',$header);
        $accessToken = $headerParts[1];
        try {
            $decoded = JWT::decode($accessToken, new Key($this->privateKey, 'HS256'));
            $userId = $decoded->user_id;
        } catch (\Exception $e) {
            return $this->failUnauthorized('Invalid access token');
        }


        $user = $this->model->find($userId);